Public Types | Public Member Functions | Static Public Member Functions | List of all members
Geometry::GJKResult< VectorType > Class Template Reference
Geometry
#include <GJK.hpp>
 Public Types
enum class  | CollisionType { UNDEFINED , COLLISION , NO_COLLISION , COLLISION_NOT_FOUND }
 Public Member Functions
operator bool () const
 bool  | IsCollided () const
 bool  | IsNotFound () const
 template<typename DistanceType >
bool  | IsCloser (DistanceType dist) const
 Static Public Member Functions
 static GJKResult  | Collision ()
 static GJKResult  | NoCollision (const VectorType &support, const VectorType &direction)
 static GJKResult  | NotFound (const VectorType &support, const VectorType &direction)
Detailed Description
template<typename VectorType>
 class Geometry::GJKResult< VectorType >
The result of the collision detection.